Autodesk.Revit.DB.Definitions.GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
Returns: An IEnumerator object that can be used to iterate through the collection.

Autodesk.Revit.DB.Definitions.GetEnumerator
Retrieves an enumerator to the collection.
Returns: The enumerator.

Autodesk.Revit.DB.Definitions.Size
The number of definitions in the collection.

Autodesk.Revit.DB.Definitions.IsEmpty
Identifies if the definitions collection is empty.

Autodesk.Revit.DB.Definitions.Contains(Autodesk.Revit.DB.Definition)
Tests for the existence of a definition within the set.
Returns: True if the definition was found, false otherwise.
definition: The definition to look for.

Autodesk.Revit.DB.Definitions.Create(Autodesk.Revit.DB.ExternalDefinitionCreationOptions)
Creates a new parameter definition using specified options.
option: The options used to create the new parameter definition.
Returns: If successful a reference to the new parameter definition is returned, otherwise null.
Remarks: This method only supports creation of new external definitions (shared parameters).
options.Name cannot include non-printable characters.
options.Name is already present in the associated shared parameter definitions.
options.GUID is already present in the associated shared parameter definitions.
Since:
2015

Autodesk.Revit.DB.Definitions.Item(System.String)
Retrieves a definition by a given name.
name: The name of the parameter definition for which to search.
Remarks: If the definition is not found then null will be returned.

Autodesk.Revit.DB.Definitions.#ctor
Constructs an empty set of parameter definitions.

Autodesk.Revit.DB.Definitions
A base class that supports the addition of new parameter definitions.
Remarks: There are two derivations of this class, one of which handles external parameters
and another which handles internal parameters.